Autodesk.Revit.DB.STLExportResolution
Since:
2021.1
An enumerated type listing possible options to control the tessellation quality.
Since:
2021.1

Autodesk.Revit.DB.STLExportResolution.Coarse
STL exporting with coarse resolution.

Autodesk.Revit.DB.STLExportResolution.Medium
STL exporting with medium resolution.

Autodesk.Revit.DB.STLExportResolution.Fine
STL exporting with fine resolution.

Autodesk.Revit.DB.STLExportResolution.Custom
STL exporting with custom resolution (all possible STL tessellation parameters have default values).